{"text": "Ned aKelly is such an important story to Australians but this movie is awful. It's an Australian story yet it seems like it was set in America. Also Ned was an Australian yet he has an Irish accent...it is the worst film I have seen in a long time", "label": 0}
{"text": "Sorry, gave it a 1, which is the rating I give to movies on which I walk out or fall asleep. In this case I fell asleep 10 minutes from the end, really, really bored and not caring at all about what happened next.", "label": 0}
{"text": "This movie is so bad, I knew how it ends right after this little girl killed the first person. Very bad acting very bad plot very bad movie<br /><br />do yourself a favour and DON'T watch it 1/10", "label": 0}
{"text": "Unwatchable. You can't even make it past the first three minutes. And this is coming from a huge Adam Sandler fan!!1", "label": 0}
{"text": "You'd better choose Paul Verhoeven's even if you have watched it.", "label": 0}
{"text": "photography was too jumpy to follow. dark scenes hard to see.<br /><br />Had good story line too bad it got lost somewhere. Too noisy for what was really happening Bottom line is it's a baddddd movie", "label": 0}
{"text": "This was an incredibly stupid movie. It was possibly the worst movie I've ever had the displeasure of sitting through. I cannot fathom how it ranks a rating of 5 or 6.............", "label": 0}
{"text": "Other than some neat special effects, this movie has nothing to offer. They threw in some gore and some nudity to try and make it interesting, but with no success. Kevin Bacon's acting was pretty good, but he couldn't salvage the movies lack of plot.", "label": 0}
{"text": "Most definitely the worst Columbo ever dreamt up. No murder and the abandonment of the tried and tested formula makes this a real drag. Falk looks bored throughout and so will you be if you waste anytime watching this.", "label": 0}
{"text": "i am very disappointed with this movie because i like these french actors and i liked \"Buffet Froid\" from this Director (bertrand blier) but the script of \"Les Acteurs\" is VERY POOR. why these actors they agreed to play this poor scenario.", "label": 0}
{"text": "This has an interesting, albeit somewhat fanciful sci-fi plot, but it's wasted with poor direction and shlocky special effects. Rae Dawn Chong is appealing, despite the lack of a believable story and direction consistent with her talent.", "label": 0}
{"text": "Long, boring, blasphemous. Never have I been so glad to see ending credits roll.", "label": 0}
{"text": "I can't believe they got the actors and actresses of that caliber to do this movie. That's all I've got to say - the movie speaks for itself!!", "label": 0}
{"text": "Predictable plot. Simple dialogue. Shockingly unemotional performances. But Robert Downey, Jr. is so cute, I gave this \"poor man's afternoon special\" a 3 instead of the 1 or 2 it so richly deserved.", "label": 0}
{"text": "Boring and appallingly acted(Summer Pheonix). She sounded more Asian than Jewish. Some of the scenes and costumes looked more mid 20th century than late 19th century. What on earth fine actors like Ian Holm & Anton Lesser were doing in this is beyond me.", "label": 0}
{"text": "The first hour of the movie was boring as hell. There is no suspense, no action, not even a plot. The movie went no where. I mean they could have made the movie in 15 min short film. Overall, the movie wasn't good at all, and I don't recommend it.", "label": 0}
{"text": "After looking at monkeys (oops apes) for more than one hour, I was feeling like one too. I was an ape, spending money on this movie. Please people, hold you money in your pocket and go see some funny movie like Bridget Jones's Diary..", "label": 0}
{"text": "Apart from Helen Bonham Carter, there is nothing worthy about this movie....And the surprise ending?! The thought of a sequel is even more annoying. Save your money, wait for the video and ignore that too.", "label": 0}
{"text": "Not good! Rent or buy the original! Watch this only if someone has a gun to your head and then....maybe.<br /><br />It is like claiming an Elvis actor is as good as the real King.", "label": 0}
{"text": "I rated this a 3. The dubbing was as bad as I have seen. The plot - yuck. I'm not sure which ruined the movie more. Jet Li is definitely a great martial artist, but I'll stick to Jackie Chan movies until somebody tells me Jet's English is up to par.", "label": 0}
{"text": "Long on action and stunt work, but so short on character delineation and development that it failed to hold our interest. Not always easy to figure out which side a character is on and who's doing what to whom.", "label": 0}
{"text": "Well, not yet, at least.<br /><br />It's not listed in the worst 100...<br /><br />So let's all team up, and put it in it's rightful place.<br /><br />This is truly a bad movie. (And I liked Ishtar!) ;)", "label": 0}
{"text": "Although Twenty Minutes of Love is a harmless attempt at an early comedy, it was difficult to follow and the film quality was not very good. It does have a couple of moments that are funny, but I have seen better by Charlie Chaplin.", "label": 0}
{"text": "The only remarkable fact is the participation of Klaus Kinski who plays a priest. Don't ask me why he does it! A bad, bad movie overall.<br /><br />", "label": 0}
{"text": "It's a good movie if you plan to watch lots of landscapes and animals, like an animal documentary. And making Pierce Brosnan an indian make you wonder 'Does all those people don't recognize if someone isn't indian at plain sight?'", "label": 0}
{"text": "Comment this movie is impossible. Is terrible, very improbable, bad interpretation e direction. Not look!!!!!", "label": 0}
{"text": "I honestly don't understand how tripe like this gets made. The worst junior-high talent show skit you've ever seen is more entertaining than this film. Will Ferrell's wrestling fetish provides the only (briefly) humorous moments. Utterly horrible.", "label": 0}
{"text": "being a NI supporter, it's hard to objectively review a movie glorifying ulster nationalists. characters who are hard to root for, typical heavy-handed anti-violence messages, and a predictable 'poetic justice' ending makes this an awkward watch...", "label": 0}
{"text": "and this movie has crossed it. I have never seen such a terrible movie in my life! I mean, a kid's head getting cut off from the force of an empty sled? A snowman with a costume that has the seams clearly visible? This was a pitiful excuse for a movie.", "label": 0}
{"text": "THis movie may be the worst movie I have ever seen. Basically it is right above Leprachaun 5, the only difference is that it missing Ice T. The scene where he does the chick with the carrott...priceless. Oh yeah they made a second one, genius", "label": 0}
{"text": "Working with one of the best Shakespeare sources, this film manages to be creditable to it's source, whilst still appealing to a wider audience.<br /><br />Branagh steals the film from under Fishburne's nose, and there's a talented cast on good form.", "label": 0}
{"text": "Ugh. This is a terrible film, full of disastrous comic relief, no scares, and scary leaps in story and plotline. The only creepy thing here is the leading lady's hats. Lugosi was on his downhill slide and it shows. I give this a 1, and this ain't no fun.", "label": 0}
{"text": "Please avoid this movie at all costs. This is without a doubt, the worst movie I've ever seen. Most movies have at least one redeeming value. This has none. Totally horrible!", "label": 0}
{"text": "This movie stinks. The stench resembles bad cowpies that sat in the sun too long. I can't believe that so many talented actors wasted their time making such a hopelessly awful film. Whew!", "label": 0}
{"text": "A dreary, hopelessly predictable film set in a most unpleasant setting (lower Coachella Valley). Acting is as amateurish as any I've seen. Looks like a screenwriting 101 script. However, it does function as a great sedative.", "label": 0}
{"text": "I wouldn't rent this one even on dollar rental night.", "label": 0}
{"text": "The acting may be okay, the more u watch this movie, the more u wish you weren't, this movie is so horrible, that if I could get a hold of every copy, I would burn them all and not look back, this movie is terrible!!", "label": 0}
{"text": "I've seen about 820 movies released between 1931-39, and THE INFORMER is the worst major release I've seen from that time span. Awful, despicable, unpleasant, unhappy, unredeemable saga of a complete Loser. Watch a 1934 B Western instead.", "label": 0}
{"text": "Despite its interesting premise, 'Sniper' is quite tedious. With a tighter script and sharper directing it could have been electrifying; instead it plods along with little tension.", "label": 0}
{"text": "This movie is not for the faint or weak of heart. It couldn't decide if it was going to be porn or legit. It was neither one. It was just bad. There was nothing in this movie to make me want to see anything else made by these people again.", "label": 0}
{"text": "Its hard to make heads or tails of this film. Unless you're well oiled and in the mood to mock, don't view Santa Claus. It mixes Santa, Satan, Merlin, and moralizing in a most unappetizing way. It certainly is not for fretful children.", "label": 0}
{"text": "Great movie - especially the music - Etta James - \"At Last\". This speaks volumes when you have finally found that special someone.", "label": 0}
{"text": "It feels like swedish movies are trying to become more american and I just don´t get it. In this movie the performance of some of the actors is horrible and the script is nothing special. Don´t waste your time!", "label": 0}
{"text": "Too bad Chuck Norris has gone to TV. He made some good movies before he hit TV. This is a typical TV movie intended to pass the time. Unfortunately it wastes Chuck's talent as an actor. I hope he returns to the big screen some day.", "label": 0}
{"text": "this movie is the worst ive seen.. nicole kidman really dissapointed me.. this movie has nothing. i would not watch it again even if it were the last movie on earth. great actors but bad script.", "label": 0}
{"text": "The script for this movie was probably found in a hair-ball recently coughed up by a really old dog. Mostly an amateur film with lame FX. For you Zeta-Jones fanatics: she has the credibility of one Mr. Binks.", "label": 0}
{"text": "This is absolutely the worst trash I have ever seen. When I saw it in the theater (arghhh!), it took 15 full minutes before I realized that what I was seeing was the feature, not a sick joke!", "label": 0}
{"text": "Rip off of \"Scream\" or especially \"I know what you did last summer\", there's some entertainment here, and a little scary, but they needed some originality.<br /><br />An entertainment score? 6.5/10 Overall? 5.5/10", "label": 0}
{"text": "I love all his work but this looks like nothing.. sorry.. This looks more like a \"David Lynch copycat\". I think people like it only because \"it's from David Lynch\".", "label": 0}
{"text": "It was just a terrible movie. No one should waste their time. Go see something else. This movie is, without a doubt, one of the worst movies I have ever seen in my life. If you want to see a good movie, don't see Made Men.", "label": 0}
{"text": "Cool idea... botched writing, botched directing, botched editing, botched acting. Sorta makes me wish I could play God and strike everyone involved in making this film with several bolts of lightning.", "label": 0}
{"text": "I read the novel some years ago and I liked it a lot. when I saw the movie I couldn't believe it... They changed everything I liked about the novel, even the plot. I wonder what did Isabel Allende (author) say about the movie, but I think it sucks!!!", "label": 0}
{"text": "The direction struck me as poor man's Ingemar Bergman. The inaudible dialogue was annoying. The somber stoicism that all characters except Banderas' showed made me think they were drugged. I think the director ruined it for me.", "label": 0}
{"text": "I regret that I've seen this movie. Can't believe that the creator of Best Intentions and Pelle the Conqueror could make such a bleak and boring film. What a waste!", "label": 0}
{"text": "Roeg has done some great movies, but this a turkey. It has a feel of a play written by an untalented high-school student for his class assignment. The set decoration is appealing in a somewhat surrealistic way, but the actual story is insufferable hokum.", "label": 0}
{"text": "This is the weakest of the series, not much of a plot and a rather odd-looking Wallace. But it's still pretty good, considering. A sign of greater things to come!<br /><br />6/10", "label": 0}
{"text": "What a horrible comedy. Totally lame. The supposed \"humor\" was simple and stupid. Stanly Tucci (a great actor) had the only parts worth chuckling at. And he was tied up and gagged at the time. Don't waste your time with this one. It deserves a 0/10.", "label": 0}
{"text": "Pointless, humourless drivel.....meant to be a comedy; but not one laugh in the whole film. Gratuitous violence often with guns. What kind of warped mentality can either make or say this is a good film?! 1 out of 10.", "label": 0}
{"text": "I found the DVD version of this movie at a rummage sale. The basic premise is an affair between a teacher/coach a student. The acting is weak and the plot razor thin.<br /><br />This movie had all the depth and plot development of an adult film.", "label": 0}
{"text": "The movie was disappointing. The book was powerful. The views and the learning of Little Tree were powerfully portrayed in the book. The movie just coasted along and finally dribbled away. Still a nice tale for kids.", "label": 0}
{"text": "Spanish horrors are not bad at all, some are smart with interesting stories, but is not the case of \"Second Name\". It is badly directed, badly acted and boring...boring...boring, a missed chance for an interesting story.", "label": 0}
{"text": "I have never seen such terrible performances in all my life.<br /><br />Everyone in the entire film was absolute rubbish.<br /><br />Not one decent actor/actress in the whole film, it was a joke.<br /><br />Reminded me of drama at school...", "label": 0}
{"text": "<br /><br />I watched this movie just a little while ago and I found that this movie was terrible! It moved very slowly and was hardly entertaining!<br /><br />Sorry for all those that liked it.... this is only my opinion!", "label": 0}
{"text": "I felt asleep, watching it!!! (and I had tickets for the midnight- premiere) Any questions? The most disturbing scene, as far as I can remember, was the techno-dance-i-dont-know-what-that-was-scene. By the way what an ending!?", "label": 0}
{"text": "Cheap, amateurish, unimaginative, exploitative... but don't think it'll have redeeming amusement value. About as unentertaining, uninstructive and just plain dull as a film can be.", "label": 0}
{"text": "Easily the worst movie I have ever seen in my life. Direction : none. Story: pathetic. Screenplay : that will be a good idea. There is a lot of gratuitous graphics, all of pathetic quality. Preserve your sanity, dont ever see this movie !", "label": 0}
{"text": "Another wonderful Patterson book made into an incredibly awful movie. If the big budget movies don't work then why make a low budget made for t.v. movie that's 10 times worse! I am desperate for a good movie that will do ONE of his books justice!", "label": 0}
{"text": "I have a feeling that Dr. Dolittle was intended for an audience composed entirely of children. I think I would have had a better time if I sat at home and watched a sit-com. My favorite characters in the movie were the pet hamster and the two alley mice.", "label": 0}
{"text": "Everyone involved with this project should be ashamed as to the result of their efforts. Oh. I laughed a coupe of times , but I laughed a couple of times during Schindler's list also. They really screwed up a good premise.", "label": 0}
{"text": "This movie was way too slow and predictable.I wish i could say more but i can't.If you enjoy action/adventure films,this is not one to see.I'd suggest you go see movies like;Behind Enemy Lines with Owen Wilson and Iron Eagle with Louis Gossett Jr.", "label": 0}
{"text": "Did anybody succeed in getting in this movie?<br /><br />It's a total mess to me: a vague historical/sentimental context instead of a plot, a pretentious imagery as mise en scene and it lasts two hours!<br /><br />Shame on those who wasted money here.", "label": 0}
{"text": "A mix of Ninja stuff mixed with a sub-James Bond storyline. The result is incredibly awful and boring, being just the stage for endless gun battles. I can't believe this was released in theaters. Terminate this movie.", "label": 0}
{"text": "Bad movie. It´s too complicated for young children and too childish for grown-ups. I just saw it because I´m a Robin Williams fan and I was very disappointed.(", "label": 0}
{"text": "Being S Club Seven, the film already boosts an ecstatic atmosphere! But seriously, Oprah has a point when claiming: \"Don't go there, girl!\" Spice World suddenly doesn't seem to be all that bad... I take my money elsewhere!", "label": 0}
{"text": "Without question, the worst ELVIS film ever made. The movie portrays all Indians as drunk, stupid, and lazy. Watch ELVIS's skin change color throughout the film.", "label": 0}
{"text": "A rating of \"1\" does not begin to express how dull, depressing and relentlessly bad this movie is.", "label": 0}
{"text": "This movie was lame, lame, lame. What a build up! What a let down. All form, no substance. A terrible waste of talent and time. Would not recommend it to my husband's dog, who will watch anything.", "label": 0}
{"text": "My ten-year old liked it. For me it was hard to get through it. Christopher Lloyd played it way over the top and the suit was tedious and unfunny. Sorry to see Jeff Daniels in this.", "label": 0}
{"text": "So so special effects get in the way of recapturing the interesting relationship between Uncle Martin and Tim O'Hara that we remember from the TV series. And what was with the suit? Annoying!", "label": 0}
{"text": "First one was much better, I had enjoyed it a lot. This one has not even produced a smile. The idea was showing how deep down can human kind fall, but in reference to the characters not the film-maker.", "label": 0}
{"text": "This thing was bad. Really bad. I mean, low budget can sometimes be very inspiring, but not this. The story was so off-the-shelf, the alien's behaviour so illogical, the characters so clichéed. I found nothing good in it. And I did try.", "label": 0}
{"text": "This film is not even worth walking to the movie theatre. No jokes, but stupid and boring laughing on repeated disgusting stuff. The music and the girls are great, unfortunately you have to watch the whole movie to enjoy them. It was weak, very very weak.", "label": 0}
{"text": "This movie features Charlie Spradling dancing in a strip club. Beyond that, it features a truly bad script with dull, unrealistic dialogue. That it got as many positive votes suggests some people may be joking.", "label": 0}
{"text": "This is the only movie that my wife and I have ever walked out on. Totally sucked. We saw it in Omaha even. Not funny at all, looks like a 14 year old kid wrote the humor. I can't believe these real politicians were actually in the movie. awful.", "label": 0}
{"text": "Imagine the worst A-team episode Add even more bad taste Remove humor and you might get an idea of how despicable this movie is ! Looks like a teenager stole Daddy's Camcorder and filmed the explosion of his little sister Barbie model house. Pathetic.", "label": 0}
{"text": "If you're in the mood for some dopey light entertainment, this will pass the time. If you expect one jot of plausibility, don't bother. To me, the dance scene looked like it was exaggerated for comic effect; it didn't look especially hot or skilled.", "label": 0}
{"text": "I saw this in the summer of 1990. I'm still annoyed by how bad this movie is in 2001.<br /><br />Implausible plot. You'd have to be a child to think this could happen.<br /><br />I'm just really annoyed by it. Don't see this.", "label": 0}
{"text": "I saw this in the summer of 1990. I'm still annoyed by how bad this movie is in 2001.<br /><br />Implausible plot. You'd have to be a child to think this could happen.<br /><br />I'm just really annoyed by it. Don't see this.", "label": 0}
{"text": "I think it's a great movie!! It's fun, maybe a little unrealistic, but fun and dramatic!! I would like to see it again, if they were showing it in TV!! Just 1 question: Are we still talking about the same movie???", "label": 0}
{"text": "I only watched this film from beginning to end because I promised a friend I would. It lacks even unintentional entertainment value that many bad films have. It may be the worst film I have ever seen. I'm surprised a distributor put their name on it.", "label": 0}
{"text": "Not very interesting teen whodunit saved from being a turkey from some decent performances. The main cast consisting of Taye Diggs, Mia Kirshner, Dominique Swain and surprisingly Meredith Monroe are all good but the story is not very original.", "label": 0}
{"text": "A pointless movie with nothing but gratuitous violence. The only fun I had was playing \"spot the location\", as much of it was filmed in my home town of Regina, Saskatchewan. I like to support locally produced films but this one was a major disappointment.", "label": 0}
{"text": "Dreadful acting. A thinly veiled attempt to slam those on the left side of the aisle.<br /><br />Women are subjugated and revolve around men. Tom Selleck shows his acting range from A to B.", "label": 0}
{"text": "this video is 100% retarded. besides the brain cell killing acting and plot, it's way too long. don't waste your money at the video store. i actually was mad that i sat through this garbage and spent money on it. just absolutely awful.", "label": 0}
{"text": "<br /><br />I didn't see They Call Me Trinity, but this sequel is really unfunny at all. It has many gags that are supposed to make people laugh. I guess the filmmaker just don't have the talent to do it right. Wonder why it was so popular in the 70s.", "label": 0}
{"text": "This was the worst MTV Movie Awards EVER!!! I barely laughed, none of the presenters were funny, the hosts really sucked, and the parodies weren't so great either. Why can't we go back to the good olden days when the show was a riot?", "label": 0}
{"text": "This is one of the worst movies I saw! I dunno what are the reasons for shoting suck a crap. Don't waste your time watching this. Good actors, but extremely bad screenplay and dialogues. Hope there'll be no Blanche 2 :-) Avoid this movie by all means!", "label": 0}
{"text": "I saw this movie on Mystery Science Theater 300. It sucked so much. If I hadn't been watching it on MST3K, I probably would've thrown it out the window. The characters were incredibly lame and it didn't provide much of a plot in my opinion.", "label": 0}
{"text": "I had high expectations for this movie and was excited about renting it but was very disappointed when I saw it. It was very poorly written and sort of just fell apart. There wasn't a lot of good anything in this movie except maybe special effects.", "label": 0}
{"text": "This is possibly the worst of all the Columbo movies. Andrew Stevens' acting is poor as the villain, and the plot is weak. In fact none of the cast seem able to act other than Peter Falk, who puts in a creditable performance as the Lieutenant.", "label": 0}
{"text": "no comment - stupid movie, acting average or worse... screenplay - no sense at all... SKIP IT!", "label": 0}
{"text": "Some 25 year olds behave like teenagers, coping with the death of a high-school mate, trying to find their purpose in live and love. The script is so lame that I had to force myself to even finish this movie. Stay away from it. 1/10", "label": 0}
{"text": "There was a reasonably good looking girl starring the film(Zoe Mclellan) but even her looks couldn't stop me from voting it the lowest possible - one.<br /><br />The plot is bad and irrational.<br /><br />What more can I say. The movie sucks.", "label": 0}
{"text": "It's terrific when a funny movie doesn't make smile you. What a pity!! This film is very boring and so long. It's simply painfull. The story is staggering without goal and no fun.<br /><br />You feel better when it's finished.", "label": 0}
{"text": "I could only get through about 25 mins of it. Not one laugh in the 25 minutes I gave it, one of the most painful films I've ever had to endure. Chris Kattan is so nervous on screen that it made me nervous to watch him. Just a horrible movie.", "label": 0}
{"text": "I didn't mind the film that much, but it was incredibly dull and boring. A few laughs here and there but nothing to go crazy for.<br /><br /> You should give it a go if you like silly, stupid humour because this is the film for you.", "label": 0}
{"text": "This was a quite brutal movie. There were huge implausibilities, and a silly script, bad acting, etc.<br /><br />The only reason to watch this movie is that from time to time some quite impressive sets of breasts were exposed.", "label": 0}
{"text": "A movie best summed up by the scene where a victim simulates disembowelment by pulling some poor animal's intestines out from under her T-shirt. Too terrible for words.", "label": 0}
{"text": "This horrible! The acting, costumes, production values, editing, the script, everything about this film is as bad as it can get. It looks as if it was filmed with a video camera. Can you give a movie a negative rating? Watch The Ring instead.", "label": 0}
{"text": "Ludicrous violations of the most basic security regs are only the beginning. It's hard to see how they achieved such abysmal trash on such a low budget. I turned it off once, then got curious to see if it could get any worse. It did.", "label": 0}
{"text": "Ok,so.....guy gets bitten by a bat and then turns into a bat (well,sorta). I can only assume this made sense to SOMEONE at the time! Aren't bats supposed to fly, use radar, and eat bugs instead of attacking humans tho?", "label": 0}
{"text": "I have seen a lot of movies...this is the first one I ever walked out of the theater on. Don't even bother renting it. This is about as boring a soap opera as one can see...at least you don't have to pay to watch a soap opera, though.", "label": 0}
{"text": "Oh, man! This thing scared the heck out of me when I first watched it... and I was SIXTEEN!!!<br /><br />That creepy animated Barbie is scary as hell! I want to stop talking about her now.", "label": 0}
{"text": "This was a big disappointment for me. I think this is the worst Mastroianni-movie ever made. Cosmatos tries too hard to make this movie a masterpiece and that makes this movie a typical \"art\"-movie. I give 4/10 for this movie.", "label": 0}
{"text": "very badly made film, the action/violence scenes are ridiculous.<br /><br />1 point for the presence of Burton and Mastroianni + 1 point for the real tragic event of the massacre of the innocent italians: 2/10.", "label": 0}
{"text": "This is the movie that I use to judge all other bad movies, and so far there hasn't been anything close.<br /><br />The only good thing I can say is that after watching this I know that I have seen the worst movie I will ever see.", "label": 0}
{"text": "If you want to see women's breasts, get a porno. There is no plot, but the last 45 minutes of this movie focus on resolving some sort of dangerous plan. The only value this movie has is that sometimes its so bad its funny, and, yes, boobs are boobs.", "label": 0}
{"text": "I'm not even gonna waste time on this one; it's not funny, not scary, practically unwatchable and only occassionaly gory(the FX suck though(no pun intended)). This is a disclaimer; WATCH AT YOUR PERIL! Ask yourself 1 question; Are slugs scary?", "label": 0}
{"text": "Movie didn't have much plot and was uninteresting. Basically you spend a lot of time watching people paint. Also it's very difficult to hear or understand the dialogue -- partially because of the accents, but also because words are mumbled.", "label": 0}
{"text": "The bad out takes from \"Reign of Fire\" strung together, without any real story.<br /><br />Dean Cain tries to be a real actor, and fails again.<br /><br />In the end the dragons quit in disgust.<br /><br />BARF!", "label": 0}
{"text": "Really, it's nothing much. I only recommend watching it if; 1.) You're a big fan of any of the main stars. 2.) If you really want to check out the first time Lucille Ball was seen with red hair.<br /><br />4 out of 10 stars", "label": 0}
{"text": "An unfunny, unworthy picture which is an undeserving end to Peter Sellers' career. It is a pity this movie was ever made.", "label": 0}
{"text": "The Fiendish Plot of Dr. Fu Manchu (1980). This is hands down the worst film I've ever seen. What a sad way for a great comedian to go out.", "label": 0}
{"text": "The banner says it all, this is one really bad movie, which is sad because I normally like Sheffer, and I have been impressed with Andrea Roth in other roles. This, however, is terrible. I wont waste any more time...its just that bad.", "label": 0}
{"text": "I always found Betsy Drake rather creepy, and this movie reinforces that. As another review said, this is a stalker movie that isn't very funny. I watched it because it has CG in it, but he hardly gets any screen time. It's no \"North by Northwest\"...", "label": 0}
{"text": "My kids picked this out at the video store...it's great to hear Liza as Dorothy cause she sounds just like her mom. But there are too many bad songs, and the animation is pretty crude compared to other cartoons of that time.", "label": 0}
{"text": "Boring, badly written Italian exploitation flick.Lots of nudity, gore and awful acting.The werewolf makeup was the only thing that would raise a laugh.Complete rubbish-even for fans of cheesy Italian horror.Please avoid.", "label": 0}
{"text": "An uptight voyeur who wants to commit suicide encounters a free spirited bad-seed who has 5 weeks to live and then they're off to discover America. Get the idea? There's not an original moment in this whole movie.", "label": 0}
{"text": "Impenetrable rubbish. This has to be one of the worst movies I have ever seen. The dialogue is ghastly, the horror effects are laughable. The only thing that kept me watching was the ever-splendid and totally underrated Michael Cule.", "label": 0}
{"text": "wow...this has got to be the DUMBEST movie I've ever seen. We watched it in english class...and this movie made ABSOLUTELY no sense. I would never, EVER watch this movie again...and my sympathy to those who have ever PAID to see it.", "label": 0}
{"text": "This is one of the worst movies I have ever seen! I saw it at the Toronto film festival and totally regret wasting my time. Completely unwatchable with no redeeming qualities whatsoever.<br /><br />Steer clear.", "label": 0}
{"text": "Well our standards have gone into the toilet. The direction was poor, the acting was mediocre and the writing was amateurish. And those are the good points. Hopefully there won't be a sequel. Otherwise, I might have to leave the country.", "label": 0}
{"text": "A very attractive and capable cast is lost in this deadly boring rehash of the slasher sub-genre. The plot a simply a collection of cliches and set-pieces that we've all seen a hundred times before. Has great potential as an insomnia treatment.", "label": 0}
{"text": "The characters are unlikeable and the script is awful. It's a waste of the talents of Deneuve and Auteuil.", "label": 0}
{"text": "People, please don't bother to watch this movie! This movie is bad! It's totally waste of time. I don't see any point here. It's a Stupid film with lousy plot and the acting is poor. I rather get myself beaten than watch this movie ever again.", "label": 0}
{"text": "When I first saw this film it was not an impressive one. Now that I have seen it again with some friends on DVD ( they had not viewed it on the silver screen ), my opinion remains the same. The subject matter is puerile and the performances are weak.", "label": 0}
{"text": "This is by far one of the worst movies i have ever seen, the poor special effects along with the poor acting are just a few of the things wrong with this film. I am fan of the first two major leagues but this one is lame!", "label": 0}
{"text": "I was really disappointed in this movie. Those that voted this thing a 10 have a screw lose. The acting was ok, kinda wooden and cardboard. The ending was sorry. I just didn't care for this at all.<br /><br />No way could I recommend this mess.", "label": 0}
{"text": "This piece ain't really worth a comment.. It's simply the worst \"horror\" movie i have ever seen. The actors are bad as bad can be and the whole plot is so silly it nearly made me cry. Shame on you I say!!", "label": 0}
{"text": "I would love to have that two hours of my life back. It seemed to be several clips from Steve's Animal Planet series that was spliced into a loosely constructed script. Don't Go, If you must see it, wait for the video ...", "label": 0}
{"text": "<br /><br />I would highly recommend seeing this movie. After viewing it, you will be able to walk out of every other bad movie EVER saying \"at least it wasn't The Omega Code.\"<br /><br />Forget my money, I want my TIME back!", "label": 0}
{"text": "Just a few words.... This movie really sucks. It's like those TV Movies with bad cast and plot. It's amazing how they could make this sequel worse than the III. Don't waste your time watching this crap, even if you like the tremors movies.", "label": 0}
{"text": "Giant crabs cursing in Japanese? What was in that drink? A terrible movie, but laughable. I love the invisible Samurai ghosties running around. Drink much beer before you see this movie.", "label": 0}
{"text": "Aside for being classic in the aspect of its cheesy lines and terrible acting, this film should never be watched unless you are looking for a good cure for your insomnia. I can't imagine anyone actually thinking this was a \"good movie.\"", "label": 0}
{"text": "This is a rotten movie.The cast seem to know just how bad it was.it starts badly and by the end is truly bad.the acting is woeful.the script could of been written on the spot.and although the movie is a horror film it has no scary scenes.Crap 1 out of 10", "label": 0}
{"text": "I was very skeptical about sacrificing my precious time to watch this film. I didn't enjoy the first one at all, and the last Jean Claude Van Damme film I liked was Blood Sports! After managing to sit through it all? Avoid, avoid, avoid!!", "label": 0}
{"text": "This movie was so bad that my i.q. went down about 40 points after seeing it. It made me wonder who could sit through the weeks it took to make it and think that it was worth it. It must of been some kind of personal favor to Van Damme.", "label": 0}
{"text": "I checked this movie out based on a favorable review on this page. It is slow moving and the payoff is a four star dud..The only mystery here is how Oscar® winner F. Murray Abraham got involved with such a lousy script!", "label": 0}
{"text": "Billy Crystal normally brings the crowd to laughter, but in this movie he and all the rest of them cannot bring any smile on my face.... or perhaps just one. They call it comedy, I say it's a waste of my time.", "label": 0}
{"text": "Shame on Julia Roberts and John Cusack. They are so talented and should not have had any part in this movie. The storyline was dumb and predictable. The jokes were not funny. The romance was not really romance. I was all too happy when this movie ended.", "label": 0}
{"text": "This movie is terrible but it has some good effects.", "label": 0}
{"text": "Probably the worst film I've ever seen, the acting and story were terrible and I almost fell asleep. The only good actor was Colm Meaney. I had the impression to see the same scenes again and again until the end, no emotion, no charisma...nothing !", "label": 0}
{"text": "Malcolm McDowell has not had too many good movies lately and this is no different. Especially designed for people who like Yellow filters on their movies.", "label": 0}
{"text": "Horrible waste of time - bad acting, plot, directing. This is the most boring movie EVER! There are bad movies that are fun (Freddy vs. Jason), and there are bad movies that are HORRIBLE. This one fits into the latter. Bottom Line - don't waste your time.", "label": 0}
{"text": "Once in a while you get amazed over how BAD a film can be, and how in the world anybody could raise money to make this kind of crap. There is absolutely No talent included in this film - from a crappy script, to a crappy story to crappy acting. Amazing...", "label": 0}
{"text": "We know from other movies that the actors are good but they cannot save the movie. A waste of time. The premise was not too bad. But one workable idea (interaction between real bussinessmen and Russian mafia) is not followed by an intelligent script", "label": 0}
{"text": "Perhaps the biggest waste of production time, money and the space on the video store shelf. If someone suggests you see this movie, run screaming in the other direction. Unless, of course, you're into self-abuse.", "label": 0}
{"text": "This movie was absolutely terrible. I can't believe I paid to see it in the theatre. I wouldn't watch it on free cable t.v. I'm surprised that Joe Magtena even made it. Do not waste your time with this movie.", "label": 0}
{"text": "\"Ally McBeal\" was a decent enough show, but it was very overrated. The characters become boring after a while and the jokes begin to fall short.<br /><br />I think it chose an appropriate point in time to leave - it was starting to outstay its welcome.", "label": 0}
{"text": "This tear-teaser, written by Steve Martin himself, is so unbelievably bad, it makes you sick to your stomach!<br /><br />The plot is pathetic, the acting awful, and the dialogue is even more predictable than the ending.<br /><br />Avoid at all costs!", "label": 0}
{"text": "HORRID!!<br /><br />The special effects make the TV version of \"Tremors\" look real!<br /><br />No one in the cast can act.<br /><br />Kind of like the '62 \"Voyage to the Bottom of the Sea\" meets the cartoon ocean going electric eel cartoons.", "label": 0}
{"text": "Slim Slam Slum is a sad and disappointing picture. There is absolutely no reason to this sorry excuse for a picture. Don`t go there, what ever you do, don`t. Watch TV-Shop for 10 hours straight instead. That way you will be slightly amused.", "label": 0}
{"text": "This movie is so bad, it can only be compared to the all-time worst \"comedy\": Police Academy 7. No laughs throughout the movie. Do something worthwhile, anything really. Just don't waste your time on this garbage.", "label": 0}
{"text": "This is without a doubt the worst movie I have ever seen. It is not funny. It is not interesting and should not have been made.", "label": 0}
{"text": "People love the original story for its ending. The Hollywood style ending made this 99 version of 'A Dog of Flanders' just for kids movie. I didn't cry this time because the story was too Hollywood. Japanese TV series are much better.", "label": 0}
{"text": "Any movie that portrays the hard-working responsible husband as the person who has to change because of bored, cheating wife is an obvious result of 8 years of the Clinton era.<br /><br />It's little wonder that this movie was written by a woman.", "label": 0}
{"text": "I'm a Don Johnson fan, but this is undoubtedly the WORST movie, done by anybody, that I've ever seen. The acting was bad, as was the cinematography. Don should stick to doing action, because as The King, he just didn't cut it.", "label": 0}
{"text": "Ming The Merciless does a little Bardwork and a movie most foul!", "label": 0}
{"text": "Repugnant Bronson thriller. Unfortunately, it's technically good and I gave it 4/10, but it's so utterly vile that it would be inconceivable to call it \"entertainment\". Far more disturbing than a typical slasher film.", "label": 0}
{"text": "Worst movie, (with the best reviews given it) I've ever seen. Over the top dialog, acting, and direction. more slasher flick than thriller.With all the great reviews this movie got I'm appalled that it turned out so silly. shame on you martin scorsese", "label": 0}
{"text": "If you haven't seen this, it's terrible. It is pure trash. I saw this about 17 years ago, and I'm still screwed up from it.", "label": 0}
{"text": "I think that movie can`t be a Scott`s film. That is impossible. Do you remember Blade Runner? And Alien? Two greats movies versus a one. I hope didn´t see ever it. good bye!!", "label": 0}
{"text": "Were I not with friends, and so cheap, I would have walked out. It failed miserably as satire and didn't even have the redemption of camp.", "label": 0}
{"text": "Before Dogma 95: when Lars used movies as art, not just a story. A beautiful painting about love and death. This is one of my favorite movies of all time. The color... The music... Just perfect.", "label": 1}
{"text": "This is the definite Lars von Trier Movie, my favorite, I rank it higher than \"Breaking the waves\" or the latest \"Dancer in the Dark\"... I simply love the beauty of the picture...the framing is so original; acting is wonderful, A MUST SEE.", "label": 1}
{"text": "What a surprise; two outstanding performances by the lead actresses in this film. This is the best work Busy Phillips has ever done and the best from Erika Christensen since Traffic. This film certainly should be in Oscar contention. See this movie!", "label": 1}
{"text": "Another good Stooge short!Christine McIntyre is so lovely and evil and the same time in this one!She is such a great actress!The Stooges are very good and especially Shemp and Larry!This to is a good one to watch around Autumn time!", "label": 1}
{"text": "Liked Stanley & Iris very much. Acting was very good. Story had a unique and interesting arrangement. The absence of violence and sex was refreshing. Characters were very convincing and felt like you could understand their feelings. Very enjoyable movie.", "label": 1}
{"text": "A wonderful movie! Anyone growing up in an Italian family will definitely see themselves in these characters. A good family movie with sadness, humor, and very good acting from all. You will enjoy this movie!! We need more like it.", "label": 1}
{"text": "One of my favorite scenes is at the beginning when guests on a private yacht decide to take an impromptu swim - in their underwear! Rather risqué for 1931!", "label": 1}
{"text": "A funny comedy from beginning to end! There are several hilarious scenes but it's also loaded with many subtle comedic moments which is what made the movie for me. Creative story line with a very talented cast. I thoroughly enjoyed it!", "label": 1}
{"text": "Wonderful film that mixes documentary and fiction in a way that makes the spectator question: what is the extent of truth in documentary films or is there such a thing as an objective documentary.", "label": 1}
{"text": "Don't know how this missed award nominations. Great film. Certainly of the calibre of \"Beautiful Mind\" Great acting, photography, script and drama. I can't imagine anyone not being entranced by this film.", "label": 1}
{"text": "for those of you who love lord of the rings and love special effects, watch this movie! this will be sure to keep you glued to the screen. you will probably even like it if you like watching people fight with magical stuff.", "label": 1}
{"text": "\"Foxes\" is a great film. The four young actresses Jodie Foster, Cherie Currie, Marilyn Kagan and Kandice Stroh are wonderful. The song \"On the radio\" by Donna Summer is lovely. A great film. *****", "label": 1}
{"text": "I simply love this movie. I also love the Ramones, so I am sorta biased to begin with in the first place. There isn't a lot of critical praise to give this film, either you like it or you don't. I think it's a great cult movie.", "label": 1}
{"text": "I thought this was one of those really great films to see with a bunch of close friends. I laughed and cried and laughed and cried at the same time. It was just really touching. Although not a new concept this was a very well made film.", "label": 1}
{"text": "I think the weighted average for this film is too low. I give it a 7. Very entertaining, although over the top in a few places. My wife says it passes the Danielle Steele test. Superb performances throughout, particularly by Andie MacDowell.", "label": 1}
{"text": "The movie is great and I like the story. I prefer this movie than other movie such The cell ( sick movie ) and Highlander ( silly movie ). I just tell the truth, I like a reality hehe and also a true story :)<br /><br />", "label": 1}
{"text": "Did Sandra (yes, she must have) know we would still be here for her some nine years later?<br /><br />See it if you haven't, again if you have; see her live while you can.", "label": 1}
{"text": "Great acting, great movie. If you are thinking of building see this movie first. The dollar amounts may have changed but everything else is the same. The humor is true to life and emotions are those that anyone who has built has felt.", "label": 1}
{"text": "this is the best sci-fi that I have seen in my 29 years of watching sci-fi. I also believe that Dark Angel will become a cult favorite. The action is great but Jessica Alba is the best and most gorgeous star on TV today.", "label": 1}
{"text": "I just saw the movie on tv. I really enjoyed it. I like a good mystery. and this one had me guessing up to the end. Sean Connery did a good job. I would recomend it to a friend.", "label": 1}
{"text": "As usual, Sean Connery does a great job. Lawrence Fishburn is good, but I have a hard time not seeing him as Ike Turner.", "label": 1}
{"text": "This Schiffer guy is a real genius! The movie is of excellent quality and both entertaining and educating.<br /><br />I didn't know what a weather girl was before I learned it here.", "label": 1}
{"text": "I hope she can keep acting and directing. She's surely up to the task and could easily develop that visionary streak into a long career of unconventional and rare works of art. Her work has a rare kind of generosity and her timing is spot-on! Oy I'm kvell", "label": 1}
{"text": "This movie is brilliant. The comments made before is from someone who obviously doesn't get it. The movie is campy- yes! But it is uplifting and fun. This movie is an underground hit and brings comparisons to Absolutely Fabulous. It is a must see!", "label": 1}
{"text": "Kept my attention from start to finish. Great performances added to this tremendous film. Mr. Pacino once again gives us another brilliant character to enjoy.", "label": 1}
{"text": "Brilliant execution in displaying once and for all, this time in the venue of politics, of how \"good intentions do actually pave the road to hell\". Excellent!", "label": 1}
{"text": "I havent seen that movie in 20 or more years but I remember the attack scene with the horses wearing gas-masks vividly, this scene ranks way up there with the best of them including the beach scene on Saving private Ryan, I recommend it strongly.", "label": 1}
{"text": "I saw this film by chance on the small box. It has a fantastic and chilling scene about poisonous gas. A lot about fanatical patriotism. A bit of eroticism. I can't believe it's still waiting for 5 votes!!", "label": 1}
{"text": "Excellent film. Suzy Kendall will hold your interest throughout. Has not been shown on American TV for a decade. One scene that has always stayed with me is the German cavalry gas attack. You will find others. Hope they soon put it on tape.", "label": 1}
{"text": "Much underrated camp movie on the level of Cobra Woman, etc. Photographic stills resemble Rembrandt prints. Sometimes subtle dialog and hidden literate touches found throughout.", "label": 1}
{"text": "I don't know how anyone could hate this movie. It is so funny. It took a unique mind to come up with this storyline. It's not your typical alien movie. These aliens are so stupid and confused. You need to rent it at least once.", "label": 1}
{"text": "Laughs, adventure, a good time, a killer soundtrack, oscar-worthy acting, and special effects/ animitronics like none other, what else could you want in a movie? If you see this will be on the telly, WATCH IT, otherwise, run out now to RENT IT!!!", "label": 1}
{"text": "Paul & Grace Hartman are my husbands grandparents. They were both deceased when we met so watching old movies is a good way to see them and their work. I have always enjoyed old movies and was very happy to discover that this was also a very good one.", "label": 1}
{"text": "I thought this film was just about perfect. The descriptions/summaries you'll read about this movie don't do it justice. The plot just does not sound very interesting, BUT IT IS. Just rent it and you will not be sorry!!", "label": 1}
{"text": "I caught this movie about 8 years ago, and have never had it of my mind. surely someone out there will release it on Video, or hey why not DVD! The ford coupe is the star.......if you have any head for cars WATCH THIS and be blown away.", "label": 1}
{"text": "Verry classic plot but a verry fun horror movie for home movie party Really gore in the second part This movie proves that you can make something fun with a small budget. I hope that the director will make another one", "label": 1}
{"text": "This unpretentious Horror film is probably destined to become a cult classic. Much much better than 90% of the Scream rip-offs out there! I even hope they come up with a sequel!", "label": 1}
{"text": "I felt drawn into the world of the manipulation of mind and will at the heart of the story. The acting by Nolte, Lee, Arkin and the supporting cast was superb. The strange twists in the Vonnegut story are made stranger by odd details.", "label": 1}
{"text": "Although not one of Vonnegut's better known works, it is a definite \"must-see\". Interestingly thought out, I especially like how the director filmed the couple in love.", "label": 1}
{"text": "Touching; Well directed autobiography of a talented young director/producer. A love story with Rabin's assassination in the background. Worth seeing !<br /><br />", "label": 1}
{"text": "Excellent film. I cried when she cried, I loved when they loved , I was frustrated when they were. This film touched my heart. It was a reality check for me since this is reality for me, a 19 year old soldier", "label": 1}
{"text": "with very little screen time and money, Dan Katzir manages to do so much. This movie, in its heart-warming simplicity, touches the beauty of love from a fresh angle. rejuvinated lust", "label": 1}
{"text": "I enjoyed the story by itself, but the things that I learned about WWI Planes & boats, make this movie a must see. The close-ups on the plane & the torpedo boat & how they were used were completely new to me. I heartily recommend.", "label": 1}
{"text": "The way this story played out and the interaction between the 2 lead characters may lead me to believe that if the X-Files continues without Mulder and Scully, these would be a pretty good replacement duo.", "label": 1}
{"text": "I really liked this movie despite one scene that was pretty bad (the one when Samantha and Nick are flirting in the hotel). The story is so cool and can't wait to read the book! Bravo for the super station!", "label": 1}
{"text": "So many consider The Black Cat as the best Karloff/Lugosi collaboration. I disagree. The Invisible Ray is their best. A great storyline, fantastic special effects, and classic Karloff over-acting. I love it!!", "label": 1}
{"text": "This is the definitive movie version of Hamlet. Branagh cuts nothing, but there are no wasted moments.", "label": 1}
{"text": "This is actually one of my favorite films, I would recommend that EVERYONE watches it. There is some great acting in it and it shows that not all \"good\" films are American....", "label": 1}
{"text": "This film takes you on one family's impossible journey, and makes you feel every step of their odyssey. Beautifully acted and photographed, heartbreakingly real. Its last line, with its wistful hope, is one of the more powerful in memory.", "label": 1}
{"text": "ever watched. It deals so gently and subtly not only with Aids (which is only alluded) and gay life, but also with old age, dying and death. It's a deep and beautiful movie, (also visually), of a very special director. Highly recommanded1", "label": 1}
{"text": "This is one of my favorite movies of all time. I loved Rain Man with Dustin Hoffman and Tom Cruise. This movie is in some ways similar, but makes Rain Man seem artificial, shallow, unemotional, and trivial by comparison.", "label": 1}
{"text": "I liked the movie a real lot. Wanted to see it just for Dara Tomanovich, but the plot and story were ok too. A very cool change in plot when you least expect it.", "label": 1}
{"text": "If you ever see a stand up comedy movie this is the one. You will laugh nonstop if you have any sense of humor at all. This is a once in a lifetime performance from a once in a lifetime performer. This is a stand up standard.", "label": 1}
{"text": "Well I guess it supposedly not a classic because there are only a few easily recognizable faces, but I personally think it is... It's a very beautiful sweet movie, Henry Winkler did a GREAT job with his character and it really impressed me.", "label": 1}
{"text": "I'd never heard of this movie, but boy was I surprised when I caught it on TV. Great cast, great acting. Excellent movie! How can a movie with William H Macy, Neve Campbell and Donald Sutherland go wrong? I wonder why I never heard of it before.", "label": 1}
{"text": "While this is a faithful adaptation, it is much less exciting than Greene's novel. Also, it's a bit ridiculous when people say things to Boyer like, \"You're Spanish, aren't you?\"<br /><br />Still, the movie's not at all bad, just slow-moving.<br /><br />", "label": 1}
{"text": "The creators of south park in their own film here, this is a brilliant film with a huge entertainment factor. If you like Naked Gun films and are not young and not too mature or serious on your humor, you'll love this.", "label": 1}
{"text": "This is not the stuff of soap-operas but the sort of conundrums that real people face in real life. A testament to the ensemble and director for the powerful story-telling of fallible characters trying to cope but not quite succeeding.", "label": 1}
{"text": "This is a bad movie in the traditional sense, but taken for what it is meant to be it is quite good. Very funny and well made, although there are a few death scenes that are in bad taste, what with jiggling breasts as a girl suffocates and so on.", "label": 1}
{"text": "Love it, love it, love it! This is another absolutely superb performance from the Divine Miss M. From the beginning to the end, this is one big treat! Don't rent it- buy it now!", "label": 1}
{"text": "Good work by everyone, from scriptwriters, director, and cast; a lovely fun film that becomes believable for sentimental reasons only; a good film for television on those cloudy, cold wintry days when you just want to sit back and enjoy.", "label": 1}
{"text": "I don't know why I like this movie so well, but I never get tired of watching it.", "label": 1}
{"text": "I have to say I quite enjoyed Soldier. Russell was very good as this trained psychopath rediscovering his humanity. Very watchable and nowhere near as bad as I'd been led to believe. Yes it has problems but provides its share of entertainment.", "label": 1}
{"text": "I loved this movie and will watch it again. Original twist to Plot of Man vs Man vs Self. I think this is Kurt Russell's best movie. His eyes conveyed more than most actors words. Perhaps there's hope for Mankind in spite of Government Intervention?", "label": 1}
{"text": "Drum scene is wild! Cook, Jr. is unsung hero of this and many movies. Fantastic actor, great flick. A few twists that keep you moving. A must-see.", "label": 1}
{"text": "I felt a great joy, after seeing this film, not because it is a master piece, but because it convinced me of, that the Portuguese cinema became really very good. We can see here the best Portuguese actores in this field.", "label": 1}
{"text": "This film captures the true struggle with identity that is ongoing in our teenage years. It is really moving and it feels strangely like a documentary-not contrived but very real. It is very interesting and unsettling", "label": 1}
{"text": "As a huge baseball fan, my scrutiny of this film is how realistic it appears. Dennis Quaid had all of the right moves and stances of a major league pitcher. It is a fantastic true story told with just a little too much \"Disney\" for my taste.", "label": 1}
{"text": "This is a movie that plays to everyone's emotions. We all want a second chance at things. Jim Morris got one, followed his heart and got a chance to live his dream. What a great message and what a great delivery by this movie.", "label": 1}
{"text": "This movie has made me want to become a director, and Michelle Rodriguez is brilliant. How the hell wasn't she on mtv's top 25 under 25, she beats them all. This film definitely deserved the grand jury prize at sundance, best film i have ever seen.", "label": 1}
{"text": "I admit it's very silly, but I've practically memorized the damn thing! It holds a lot of good childhood memories for me (my brother and I saw it opening day) and I have respect for any movie with FNM on the soundtrack.", "label": 1}
{"text": "What can I say? I know this movie from start to finish. It's hilarious. It's an strong link to my past and will change the way I view film in the future. Hypothetically speaking :) The down-fall? There's no Socrates Johnson!", "label": 1}
{"text": "I cannot believe how unknown this movie is,it was absolutely incredible. The ending alone has stuck with me for almost thirty years. The road sign through the rearveiw mirror blew me away. If you liked \"RACE WITH THE DEVIL\" you will love this movie", "label": 1}
{"text": "Highly regarded at release, but since rather neglected. Immense importance in the history of performing arts. A classic use of embedded plots. One of my favourite films. Why hasn't the soundtrack been re-released?", "label": 1}
{"text": "Izzard was both hysterical and insightful in his humor. He definitely represents his own little niche in the comedic world.<br /><br />It's a pity more Americans won't see this stand-up routine due to its PAL-only availability.", "label": 1}
{"text": "Summer Phoenix did a great performance where you really feel what she's not able to feel and you just cannot understand what she has on her mind. Besides, she portrays a jewish girl who behaves really confronting the status quo of that century.", "label": 1}
{"text": "It is an almost ideal romantic anime! MUST SEE FOR ALL AGES! But the English dubbed version is not too good. Perhaps the 1999 version will be better.", "label": 1}
{"text": "I was particularly moved by the understated courage and integrity of l'Anglaise, in this beautifully acted, intellectually and visually compelling film. Thank you so much, Monsieur le directeur Rohmer.", "label": 1}
{"text": "This is a really interesting film. It's the first time I have seen the relationship between an older woman and a younger guy on screen without it being sensationalist. For the director of Notting Hill this is a bold move to something serious", "label": 1}
{"text": "I was overtaken by the emotion. Unforgettable rendering of a wartime story which is unknown to most people. The performances were faultless and outstanding.", "label": 1}
{"text": "Go, Igor, go, you are the proof that Slovenian films may, should and must be different. There's soul in it, and this is rare. Don't let anybody put you down!", "label": 1}
{"text": "This movie is not only the funniest film ever created, it's the greatest. My hats off to Mr. and Mrs. Zodsworth and the rest of the wacky, wacky cast. Good morning Satan, Want a donut? See it post haste! GO SEE IT NOW!", "label": 1}
{"text": "Obviously written for the stage. Lightweight but worthwhile. How can you go wrong with Ralph Richardson, Olivier and Merle Oberon.", "label": 1}
{"text": "Basic meaning of the story is a reality. Cruel true reality. Situations are very funny. You have to laugh when you see, how people can be stupid, obstinate and crazy. The best description will be, if you watch it on your own.", "label": 1}
{"text": "I watched this film over a hundred times. It is really best Serbian movie made ever.I wood like to recommend this movie to everyone. It is very good comedy. I surely like it!!!!", "label": 1}
{"text": "I really enjoyed this movie. The script is fresh and unpredictable and the acting is outstanding.It is a down-to-earth movie with characters one cares about. It brought tears into my eyes a few times but left me with a great feeling afterwards.", "label": 1}
{"text": "I really enjoyed this movie. The script is fresh and unpredictable and the acting is outstanding.It is a down-to-earth movie with characters one cares about. It brought tears into my eyes a few times but left me with a great feeling afterwards.", "label": 1}
{"text": "I liked SOLINO very much. It is a very heart-rending story of an italian family moving to Germany. And it's an story about brotherly love, hope and disappointment. And the film is never boring. Go and see SOLINO!", "label": 1}
{"text": "Lots of singing and dancing in this one, especially by Gene Kelly. Two sailors go on liberty to see if they can find love and romance. They meet up with a woman who is trying to break into show business. Musical lovers only.", "label": 1}
{"text": "A very engaging, intelligent, and well-made film. Liam Neeson and Tim Roth play their roles superbly. The cinematography is outstanding. The fight scenes are amazing. This is a film I will enjoy watching again and again. One of my favorites.", "label": 1}
{"text": "This movie is so good I could watch it all day long! Mary-Kate and Ashley were robbed at Oscar time!! If I got to be one of the actors I would be so excited!!! I can't wait for the new Charlie's Angels movie starring Mary-Kate and Ashley.", "label": 1}
{"text": "I'm a HUGE fan of the twin sisters. Although this was one of their \"not soo good\" movies. I'm not saying it's bad, I can't say it's bad, but this whole popular and not popular thingy isn't good. Although I give this movie a 4.", "label": 1}
{"text": "This movie is really funny!! The General is Keaton's finest work but there are many of his works that are more hilarious - in this one are multiple sight gags and creative humor. We watch it over and over and it only seems to get funnier!", "label": 1}
{"text": "Buster Keaton was finding his feature length voice in \"Three Ages.\" There are some fine sequences, but it doesn't quite hang together. The \"chariot race\" in \"Three Ages\" is hilarious. Included are 2 shorts, one of which, \"The Goat,\" is excellent.", "label": 1}
{"text": "Adrian Pasdar is excellent is this film. He makes a fascinating woman.", "label": 1}
{"text": "This film is one of Michael Keaton's best. Throughout the film he is 'on'. With co-stars like Ms. Henner, Joe Piscopo and Danny DeVito, you can't go wrong. Great laughs, great fun for everyone.", "label": 1}
{"text": "In Black Mask, Jet Li plays a bio-engineered super-killer turned pacifist, who has to fight against other super-killers. Bad plot, bad sfx(60 million dollar budget), but the fighting scenes were excellent! Jet Li is the greatest martial-arts star alive!", "label": 1}
{"text": "How can you resist watching a film with some swing? It's a delightful little film full of wonderful actors and a wonderful story line. Too bad they don't tour out here...I'd go see them. See it if for no other reason than to hear some good music.", "label": 1}
{"text": "My definition of a great movie is if you want to continue to see it over again. This movie for some reason strikes a cord in me even though the scenes with Scott Glenn still make me winch; I watch it over and over again and love the music!", "label": 1}
{"text": "The movie is wonderful. It shows the man's work for the wilderness and a natural understanding of the harmony of nature, without being an \"extreme\" naturalist. I definitely plan to look for the book. This is a rare treasure!<br /><br />", "label": 1}
{"text": "It's really annoying when good movies like this one go unnoticed. But I'm glad I did not miss it.<br /><br />They should re-release it with a lot more publicity. I do not think they did anything to promote it. Great work Paxton.<br /><br />", "label": 1}
{"text": "Clearly an hilarious movie.<br /><br />It angers me to see the poor ratings given to this piece of comic genius<br /><br />Please look at this for what it is, a funny, ridiculous enjoyable film. Laugh for christ sake!<br /><br />", "label": 1}
{"text": "Indian Summer is a good film. It made me feel good and I thought the cast was exceptional. How about Sam Raimi playing the camp buffoon. I thought his scenes were very funny in a Buster Keaton-like performance. Solid directing and nice cinematography.", "label": 1}
{"text": "I saw \"A Page of Madness\" in a silent film course at Wesleyan University and it haunts me still after 25 years. Truly ahead of its time - perhaps even still - this gem of a film reveals both the frightening and attractive aspects of madness.", "label": 1}
{"text": "THis movie shows us once again, how genius the Japanese directors are and were. This movie could be seen as a sort of a \"Silent - Movie Tetsuo\". Well Eisenstein...:)", "label": 1}
{"text": "I´m from Germany and I love the mvovies. I go 200 times a year. Tonight I saw \"Pecker\", it was a wonderful evening. Thank you, Mr. Waters. Everybody who has a chance to see the movie, go!!!", "label": 1}
{"text": "Enjoyable and watchable. Tim Meadows at his best. A big boost from Billy Dee Williams. He and a very funny John Witherspoon provide a solid foundation for Mr. Meadows' riffing. Have fun with this one.", "label": 1}
{"text": "This movie had it all,action,comedy,heroics,and best of all some of the finest actors.Gunga Din will remain a classic to be enjoyed by all who like good movies.Excellent picture,i have it in my collection.", "label": 1}
{"text": "This is one of the best of the genre. I saw it twice about 25yrs ago and have not had another opportunity to see it again since then. It rivals the Zatoichi series (also starring Katsu) in exciting swordplay.", "label": 1}
{"text": "Farrah Fawcett gives the best performance by an actress on film in this gritty real life attempted rape thriller where she turns the tables & gives James Russo a taste of his own medicine. A must see for any movie fan.", "label": 1}
{"text": "Farrah Fawcett gives an award nominated performance as an attempted rape victim who turns the tables on her attacker. This movie not only makes you examine your own morals, it proves that Fawcett can excel as a serious actress both as a victim and victor.", "label": 1}
{"text": "This was stupid funny movie.. Cheech and Chong are the dopiest wasted guys ever... i rate this film a 7.. but if you like this one then go see Jay and Silentbob! There funnier and crazier. Now Cheech is a sellout working on kids movies..... wheres chong?", "label": 1}
{"text": "Moonwalker is absolutely incredible !!!!!!! What else can I say !? Michael Jackson is the true King of pop, rock and soul !!! Moonwalker has everything ! Great story line, fantastic music, great visual effects, and of course it has Michael Jackson !!!!!!", "label": 1}
{"text": "Michael Is King. This film contains some of the best stuff Mike has ever done. Smooth Criminal is pure genius. The cameos are wonderful, but as always, the main event is MJ himself. He is the best, hands down.", "label": 1}
{"text": "I love this movie and never get tired of watching. The music in it is great. Any true hard rock fan should see this movie and buy the soundtrack. With rockers like Gene Simmons and Ozzy Osbourne you can't go wrong.", "label": 1}
{"text": "As far as horror flicks go, this one is pretty darn good. While it may not be a classic tale of horror and suspense, it does provide many quality chuckles that make this movie a must see if you're into the horror/comedy genre.", "label": 1}
{"text": "This movie is one of the masterpieces from Mr. Antonioni. It is about youth, distraction, happiness, alienation, materialism, honor, corruption. And it is like everything else from great Italian director -true art.<br /><br />", "label": 1}
{"text": "The movie was a big Car Commercial. :-)<br /><br />But who cares? I went to the theater to view the Shelby Cobra, Angelina & Cage.<br /><br />So I guess it was a good movie. *bg*<br /><br />", "label": 1}
{"text": "Throughly enjoy all the musical numbers each time I see this movie. Never seem to tire of it. Fred and Ginger are always a pleasure to watch. Seeing \"Lucy\" and Betty Grable before they hit the big time, is fun to watch.", "label": 1}
{"text": "Of course, the story line for this movie isn't the best, but the dances are wonderful. This story line is different from other Astaire-Rogers movies in that neither one is \"chasing\" the other. The dancing of Fred and Ginger is what makes this movie.", "label": 1}
{"text": "Surprisingly well made little movie. Short in length at about 90 minutes. For a low budget movie, very well made. Plot is slow to unravel. Cast is excellent especially Elizabeth Van Meter as the girlfriend with Tourette's Syndrome.", "label": 1}
{"text": "Beautiful to watch, but what would be the first thing you would do the moment YOU discovered Atlantis? Explore it! Here was a golden opportunity to take viewers someplace special. Instead, Disney reverted to the same old formula story telling.", "label": 1}
{"text": "jim carrey rocks! if he's in a movie its bound to be good! he did not disappoint me with this one!the rest of the cast was cute,especially little cindy lou who and martha may, i was laughing through the whole thing and cannot wait to see it again!", "label": 1}
{"text": "I grew up watching, and loving this cartoon every year. I didn't think they would be able to take a half hour (20 min!) cartoon and make it a movie. They did it. With FLYING COLOURS! Fabulous, funny, heart warming, effective movie!", "label": 1}
{"text": "One of the most excellent movies ever produced in Russia and certainly the best one made during the decline of the USSR. Incredibly clever, hilarious and dramatic at the same time. Superb acting. Overall a masterpiece. Score it 10/10. <br /><br />", "label": 1}
{"text": "Certainly any others I have seen pale in comparison. The series gives balanced coverage to all theatres of operation. No one country is given undue credit for the Allied victory. Laurence Olivier brings great weight and dignity to his role as narrator.", "label": 1}
{"text": "While essentially a remake of the original Chinese Ghost Story, this third installment has higher production values and greater subtlety in both the acting and the story. Tony Leung is particularly good. CGS III is a gorgeous, moving film.", "label": 1}
{"text": "It's this sort of movie that you try and imitate. By attempting to realise something... then flying through the air almost immediately. I'd like to do that and I know you would too!<br /><br />Great stuff!", "label": 1}
{"text": "This movie is very funny. Amitabh Bachan and Govinda are absolutely hilarious. Acting is good. Comedy is great. They are up to their usual thing. It would be good to see a sequel to this :)<br /><br />Watch it. Good time-pass movie", "label": 1}
{"text": "Ronald Colman gives a terrific performance as a stage actor who really gets into his work. When he plays Othello on the stage he takes on the persona with dire results. Good film with a great supporting cast. Well worth watching.", "label": 1}
{"text": "This was a very well scripted movie. Great fun if you just want a stupid film. Not great production value (ok, the sound really sucked) but the performance of Danny Masterson more than makes up for it.<br /><br />Watch this movie and laugh out loud!", "label": 1}
{"text": "Melissa Joan Hart shines! This show is amazing!! There is no match. Except for maybe Melissa in Clarissa Explains it All. She was marvelous in that, too. This is SO much better than Buffy, the Vampire Slayer. This show is WONDERFUL!", "label": 1}
{"text": "This is one fine movie, I can watch it any time. Rauol Julia gave an outstanding performance, we lost him too soon. Richard Dryfus is a great talent. Only thing it needed more of was Dana Delany, what a babe!", "label": 1}
{"text": "Brian De Palma's undeniable virtuosity can't really camouflage the fact that his plot here is a thinly disguised \"Psycho\" carbon copy, but he does provide a genuinely terrifying climax. His \"Blow Out\", made the next year, was an improvement.", "label": 1}
{"text": "A fine western, following the fate of those who possess the prize winning gun, a Winchester '73. It has a great cast who give superb cliche characterisations with help from the usual effective story telling direction from Mann.", "label": 1}
{"text": "Very heart warming and uplifting movie. Outstanding performance by Alisan Porter (Curly Sue). I saw this movie when it was first released and enjoyed it immensely. I just caught it again on the Mplex channel, and Curly Sue touched my heart again.", "label": 1}
{"text": "Like another reviewer said, this movie is not a heavy melodrama, but it deals with harsh realities. A very very playful movie that does not dwell for a moment. Some very good acting and some wonderful smiles as well.", "label": 1}
{"text": "My favorite part of this film was the old man's attempt to cure his neighbor's ills by putting the strong medicine in his bath. There is more than a sense of family, there is a sense of community.", "label": 1}
{"text": "This show is awesome! and I've seen it about 6 times.<br /><br />Granted it may be lacking in educational content as some people like those sort of movies, but I think it's great, very funny and excellently written!", "label": 1}
{"text": "It's highly stylized, but this movie shows that real people appear on these shows and what seems like good fun and a chance to appear on television can have serious consequences.<br /><br />Yes, i's mostly comedy, but there are some sad moments.", "label": 1}
{"text": "The blend of biography with poetry and live action with animation makes this a true work of art. The narration by Sir Michael Redgrave is moving. The length of the work makes it easily accessible for class room exposure or TV/Video time slots.", "label": 1}
{"text": "This film surprised me a little. I watch a lot of horror/sci-fi films and this is a straight-to-video release that caught me off guard a little. I believe this is Full Moon's best movie thus far and one of Jeffrey Combs best performances. Good movie.", "label": 1}
{"text": "Possibly the best movie ever created in the history of Jeffrey Combs career, and one that should be looked upon by all talent in Hollywood for his versatility, charisma, and uniqueness he brings through his characters and his knowledge of acting.", "label": 1}
{"text": "Allison Dean's performance is what stands out in my mind watching this film. She balances out the melancholy tone of the film with an iridescent energy. I would like to see more of her.", "label": 1}
{"text": "I didn't expect much when I rented this movie and it blew me away. If you like good drama, good character development that draws you into a character and makes you care about them, you'll love this movie.<br /><br />Engrossing!", "label": 1}
{"text": "What fun! Bucketfuls of good humor, terrific cast chemistry (Skelton/Powell/Lahr/O'Brien), dynamite Dorsey-driven soundtrack! Miss Powell's dance numbers have exceptional individual character and pizzazz. Her most winning film appearance.", "label": 1}
{"text": "This is an absolutely incredible film. It shows South African racism from the perspective of the victims, and provokes a feeling of anti-racism in everyone who sees it. It is the best historic film I have ever seen.", "label": 1}
{"text": "After a big tip of the hat to Spinal Tap, this movie is hilarious. Anyone who grew up watching MTV will love it and if you didn't, rent it anyway,the \"My Peanuts\" and \"A Gangster's life\" videos are worth the three bucks alone.", "label": 1}
{"text": "Just a note to add to the above comment. Fear of a Black Hat doesn't have the criminal who's image has been ripped off by the band, that's in CB4. Easily confused as the two films are so similar, but Black Hat is vastly the superior of the two..... yeah.", "label": 1}
{"text": "Brilliant movie. The drawings were just amazing. Too bad it ended before it begun. I´ve waited 21 years for a sequel, but nooooo!!!", "label": 1}
{"text": "A delightful if somewhat predictable TV movie, though I admit a little bias -- as far as I'm concered, the more Gene Wilder in this world the better. I'd love to see numerous additional movies detailing the adventures of Larry \"Cash\" Carter!", "label": 1}
{"text": "What can I say? An excellent end to an excellent series! It never quite got the exposure it deserved in Asia, but by far, the best cop show with the best writing and the best cast on televison. EVER! The end of a great era. Sorry to see you go...", "label": 1}
{"text": "The one of the most remarkable sci-fi movies of the millennium. Not only a movie but an incredible future vision, this movie establishes a new standard of s/f movies. hail and kill!", "label": 1}
{"text": "This movie had me smiling from beginning to end, partly at the humor, partly at Meg Ryan (this is the perfect character for her), and always because it's just one of the best feel-good movies I've seen. Hopefully the DVD will be out soon.", "label": 1}
{"text": "This film lingered and lingered at a small movie theater in town, and the word-of-mouth buzz got me to see it. A comedy about disabled people - the subject matter keeps lots of people away from a funny and heart-warming film.", "label": 1}
{"text": "I thought this was an excellent and very honest portrayal of paralysis and racism. This movie never panders to the audience and never gets predictable. The acting was top-notch and the movie reminded me of \"One Flew Over the Cuckoo's Nest\".", "label": 1}
{"text": "This comedy is bound to be good from the get-go. East meets west and east doesn't want to lose...west doesn't know what losing is like. It starts a little slow but it grabs you very soon and it doesn't let go. This is definitely worth seeing.", "label": 1}
{"text": "I really enjoyed this movie. Typically Ron Howard who seems to like being associated with Michael Keaton. Love the scene when Hunt travels to Japan with his sales pitch. Whoa, how did that get in there ! Cheap laughs but great value", "label": 1}
{"text": "Excellent episode movie ala Pulp Fiction. 7 days - 7 suicides. It doesnt get more depressing than this. Movie rating: 8/10 Music rating: 10/10", "label": 1}
{"text": "The only thing serious about this movie is the humor. Well worth the rental price. I'll bet you watch it twice. It's obvious that Sutherland enjoyed his role.", "label": 1}
{"text": "The Only Kung Fu Epic worth watching. The best training ever. The main character spending a hundred day's on his knees outside the shaolin temple show how desperate he is to learn kung fu to fight the manchu dogs who have taken over china.", "label": 1}
{"text": "If you like original gut wrenching laughter you will like this movie. If you are young or old then you will love this movie, hell even my mom liked it.<br /><br />Great Camp!!!", "label": 1}
{"text": "Errol Flynn's greatest movie, not just a sports movie with a wonder last 5 minutes where Ward Bond shines. Don't miss it just because you think its an old movie. Its a classic that could be easily missed. Do yourself a favour and don't.", "label": 1}
{"text": "I thought this was a quiet good movie. It was fun to watch it. What I liked best where the 'Outtakes' at the end of the movie. They were GREAT.", "label": 1}
{"text": "To quote Flik, that was my reaction exactly: Wow...you're perfect! This is the best movie! I think I can even say it's become my favorite movie ever, even. Wow. I tell you what, wow.", "label": 1}
{"text": "<br /><br />This movie is full of references. Like \"Mad Max II\", \"The wild one\" and many others. The ladybug´s face it´s a clear reference (or tribute) to Peter Lorre. This movie is a masterpiece. We´ll talk much more about in the future.", "label": 1}
{"text": "Omar Epps is an outstanding actor. I really think he gets into his character alot. When deja gets shot he shows true emotion. He also shows true emotion when remmi puts the gun to him in the room. Omar is a very talented actor!!", "label": 1}
{"text": "This is the best movie I've seen since White and the best romantic comedy I've seen since The Hairdresser's Husband. An emotive, beautiful masterwork from Kenneth Branagh and Helena Bonham Carter. It is a tragedy this movie hasn't gotten more recognition.", "label": 1}
{"text": "This was one of those times when I had nothing to do with 27 premium movie channels available to me. The Theory of Flight grabbed me and held my interest. I found it both touching and amusing, a nice combination of feelings. I recommend it!", "label": 1}
{"text": "This movie for what it is, may be one of the most amazing indie films of recent day. Made on a super small budget, the film has special effects that blow away alot of the current films! IF you have a chance watch it!", "label": 1}
{"text": "And I really mean that. I caught it last night on Vh1, and I was not expecting it to be so good. This is now one of my favorites. I must add that it has a killer soundtrack.", "label": 1}
{"text": "a pure reality bytes film. Fragile, beautiful and amazing first film of the director. Represented Spain on the Berlinale 2002. Some people has compared the grammar of the film with Almodovar's films...Well, that shouldn't be a problem...", "label": 1}
{"text": "This is a great film. Touching and strong. The direction is without question breathless. Good work to the team. I feel so sorry for Marlene, By the grace of God go you or I", "label": 1}
{"text": "This has to be one of my favourite movies of all time. The dialogue, with the constant use of puns is very tight, the cast are superb, and the plot is highly original.<br /><br />Don't take my word for it - watch this movie and enjoy it for yourself.", "label": 1}
{"text": "I have seen this film on countless occasions, and thoroughly enjoyed it each time. This is mostly due to the lovely Erika Eleniak- a great actress with incredible looks. Plus, any film starring Tom Berenger and Dennis Hopper is bound to be entertaining.", "label": 1}
{"text": "This is a 'sleeper'. It defines Nicholas Cage. The plot is intricate and totally absorbing. The ending will blow you away.<br /><br />See it whenever you have the opportunity.", "label": 1}
{"text": "I agree with the other comments. I saw this movie years ago. Christopher Plummer is hilarious as a dandy. The ribaldry is unsurpassed. If this comes out on video, I will definitely buy it.", "label": 1}
{"text": "A real classic. A shipload of sailors trying to get to the towns daughters while their fathers go to extremes to deter the sailors attempts. A maidens cry for aid results in the dispatch of the \"Rape Squad\". A cult film waiting to happen!", "label": 1}
{"text": "The first time I saw this film, I was in shock for days afterwards. Its painstaking and absorbing treatment of the subject holds the attention, helped by good acting and some really intriguing music. The ending, quite simply, had me gasping. First rate!", "label": 1}
{"text": "mature intelligent and highly charged melodrama unbelivebly filmed in China in 1948. wei wei's stunning performance as the catylast in a love triangle is simply stunning if you have the oppurunity to see this magnificent film take it", "label": 1}
{"text": "This is such a great movie to watch with young children. I'm always looking for an excuse to watch it over & over. Gena was good, Cheech was fun,the Russian was good, Maria was adorable & of course Paulie was the best!", "label": 1}
{"text": "Love it, love it, love it! This is another absolutely superb performance from the Divine Miss M. From the beginning to the end, this is one big treat! Don't rent it- buy it now!", "label": 1}
{"text": "I can't stand it when people go see a movie when they know they won't like it. My mom likes violent movies, so why did she see it? She rated it just to bring down the rating. So I know that's why it didn't have a higher rating. I give it a 6/10", "label": 1}
{"text": "A nicely done thriller with plenty of sex in it. I saw it on late night TV. There are two hardcore stars in it, Lauen Montgomery and Venus. Thankfully, Gabriella Hall has just a small part.", "label": 1}
{"text": "Never when I was a child did I love any movie more then this one. I would love to own it. I watched it every Sunday they played it on the Family Film Festival. It is an enjoyable film suitable for the whole family and the songs are wonderful.", "label": 1}
{"text": "this is really films outside (not in a motel room). With real costumes (not only strings and swimsuits). You have to see this movie. it's the only porn movie I know that is worth watching between the sex scenes.<br /><br />Bon Cinema<br /><br />Laurent", "label": 1}
{"text": "As with most Rosalind Russell movies, this one is very entertaining -- it's fun all the way through. It's definitely one of the last of this genre of film -- just good wholesome entertainment. Give it a try - I don't think you will be disappointed.", "label": 1}
{"text": "This film has renewed my interest in French cinema. The story is enchanting, the acting is flawless and Audrey Tautou is absolutely beautiful. I imagine that we will be seeing a lot more of her in the States after her upcoming role in Amelie.", "label": 1}
{"text": "This movie is very good. The screenplay is enchanting. But Meryl Streep is most impressive. Her performance is excellent. She brings me to go into the heart of her role.", "label": 1}
{"text": "As long as you go into this movie knowing that it's terrible: bad acting, bad \"effects,\" bad story, bad... everything, then you'll love it. This is one of my favorite \"goof on\" movies; watch it as a comedy and have a dozen good laughs!", "label": 1}
{"text": "I absolutely loved this movie. It met all expectations and went beyond that. I loved the humor and the way the movie wasn't just randomly silly. It also had a message. Jim Carrey makes me happy. :)", "label": 1}
{"text": "A film destined to be on late-night TV long after the present instant \"money-makers\" have long been forgotten. Perhaps a little too subtle for today's youngsters, but in time they'll grow into an appreciation of this movie.", "label": 1}
{"text": "Just the ultimate masterpiece in my opinion. Every line, every phrase, every picture is exactly in place and Lindsay Crouse and Joe Mantegna are just THE cool shrink and the sleazy con-man, so well cast. 10 out of 10!", "label": 1}
{"text": "I just watched this movie for the second time, and enjoyed it as much as the first time. It is a very emotional and beautiful movie, with good acting and great family values. Inspiring and touching!", "label": 1}
{"text": "This is a beautiful movie filled with adventure. The Genii in the bottle is a classic scene. Romantic in it's finish, all things turn out as they should be. I saw this first as a child and have remembered it as a fantasy I wished was true.", "label": 1}
{"text": "Henry Thomas showed a restraint, even when the third act turned into horrible hollywood resolution that could've killed this movie, that kept the dignity of a redemption story and as for pure creepiness-sniffing babies?", "label": 1}
{"text": "Nicole Kidman is a wonderful actress and here she's great. I really liked Ben Chaplin in The Thin Red Line and he is very good here too. This is not Great Cinema but I was most entertained. Given most films these days this is High Praise indeed.", "label": 1}
{"text": "This is a great film!! The first time I saw it I thought it was absorbing from start to finish and I still do now. I may not have seen the play, but even if I had it wouldn't stop me thinking that the film is just as good.", "label": 1}
{"text": "This movie will always be a Broadway and Movie classic, as long as there are still people who sing, dance, and act.", "label": 1}
{"text": "If you need cheering up on a cold weekday evening, this is the film for you! Excellent script and perfectly cast actors. I especially loved Ray psyching himself up in front of the mirror before gigs - inspired!", "label": 1}
{"text": "wonderful movie with good story great humour (some great one-liners) and a soundtrack to die for.<br /><br />i've seen it 3 times so far.<br /><br />the american audiences are going to love it.", "label": 1}
{"text": "I became more emotionally attached to this movie than any other I have ever watched. That may be because I can see the characters as my own grandparents, attempting to make sense of a world at war. The ending and use of Pachabel's Cannon are both amazing.", "label": 1}
{"text": "John Candy's Performance in Once Upon A Crime is possibly his best ever. It's been My Favourite Movie since it came out. I Spent 5 Years searching for it. That's How Good It Is. If You Disagree, well, that's your opinion. Enjoy The Movie.", "label": 1}
{"text": "This film made John Glover a star. Alan Raimy is one of the most compelling character that I have ever seen on film. And I mean that sport.", "label": 1}
{"text": "I have been looking for this movie for so many years. I saw this move when I was nine and loved this movie. I called Disney all the movie stores and the net. No luck. What a waste it was a very good movie. It will be missed:(", "label": 1}
{"text": "Real cool, smart movie. I loved Sheedy's colors, especially the purple car. Alice Drummond is Wise And Wonderful as Stella. I liked Sheedy's reference to how her face had gotten fatter. The roadside dance scene is brilliant. Really liked this one.", "label": 1}
{"text": "terribly underrated with matt dillon and tom skerritt, good backdrop for solid story and some memorable lines, well acted and well cast, tommy lee jones and bruce dern make you hate them with passion", "label": 1}
{"text": "i two came home from school fast as i could to catch HRpuff and stuff on t.v. that was the most fun time in my life is to watch HRpuff and stuff on t.v. growing up still love it today i am 46 years old. this year......", "label": 1}
{"text": "My favorite movie. What a great story this really was. I'd just like to be able to buy a copy of it but this does not seem possible.", "label": 1}
{"text": "I find this movie the best movie I have ever seen, because it reflects the inner strength of a young girl during the second world war. The movie is impressive, not least because it actually happened. It reminds me of the story of Anne Frank.<br /><br />", "label": 1}
{"text": "Simon's best comedy is superbly crafted by director Gene Saks and given life by the immense talents of Lemmon and Matthau. No one delivers these lines better. No one times them better. Nobody does it better.", "label": 1}
{"text": "Why did this movie fail commercially? It's got a sharp script (by Ron Shelton) and great performances by Kurt Russell and, especially, Robin Williams, in a brilliant manic nerd turn that's different from any of his other work. A great renter.", "label": 1}
{"text": "This film is fun, if your a person who likes a good campy feature film every now and then. By no means is this movie fine cinema, but if you dont take things too seriously, and can laugh at yourself once in a while, Elvira is a good frownbuster.", "label": 1}
{"text": "THis was a hilarious movie and I would see it again and again. It isn't a movie for someone who doesn't have a fun sense of a humor, but for people who enoy comedy like Chris Rock its a perfect movie in my opinion. It is really funnny", "label": 1}
{"text": "This is one of my favorite films of all time. Al Pacino acting is at its best and the story is excellent. Too bad it didn't do to well in the 80's when it was first released because people didn't get a chance to experience this classic.", "label": 1}
{"text": "if you like gangster type of movies, then this is the first one you should buy or at least rent, Al Pacino his performance is top notch. and the story is classic!! 10 / 10 !!!! Why isn't this movie in the TOP 250 list??", "label": 1}
{"text": "This movie can be described in those 2 words \"just unbelievable\". This is the best movie ever made, I just cant see why this movie isnt in the top 250. I also can't see why anybody would not love Scarface. Anyways, if you havnt seen it, it is a must buy.", "label": 1}
{"text": "Powers Boothe turns in a stellar performance as 1970's cult figure Jim Jones of the Peoples Temple. Jones physical likeness to Jones is uncanny and the story is acted out chillingly. The movie keeps you riveted and is a must see for anyone. check it out.", "label": 1}
{"text": "This movie is totally wicked! It's really great to see MJH in a different role than her Sabrina character! The plot is totally cool, and the characters are excellently written. Definitely one of the best movies!!", "label": 1}
{"text": "Brilliant kung-fu scenes, loads of melodrama, peculiar footwear symbolism and an unhappy (?) end makes Barefoot Kid an unforgettable film.<br /><br />One of the silliest subtitles I've seen...", "label": 1}
{"text": "GREAT movie and the family will love it!! If kids are bored one day just pop the tape in and you'll be so glad you did!!!<br /><br />~~~Rube<br /><br />i luv raven-s!", "label": 1}
{"text": "This movie is perfect for families to watch together. It is a great film and it deserves more credit. The special effects are stunning and spectacular. Everyone who has children should share this with theirs.", "label": 1}
{"text": "this was a very good movie i wished i could find it in vhs to buy,i really enjoyed this movie i would definaetly recommend this movie to watch i would like to see it again but can never find it in tv, it would be well worth the time to watch it again", "label": 1}
{"text": "I saw this movie once on late night t.v. and knew it was the best movie ever. This is one of the few Kung-Fu movies with a decent plot. The progression of the main character is seamless. The whole movie is great!", "label": 1}
{"text": "I saw this film on television years ago, but here several years after, I wake up in the morning, and still remember her face.<br /><br />This film is the most profoundly terrifying film I have seen.", "label": 1}
{"text": "I think it's one of the greatest movies which are ever made, and I've seen many... The book is better, but it's still a very good movie!", "label": 1}
{"text": "Thanks to this fungal film I do NOT want my Maypo, can't stomach the thought of Maltex or Wheatena, and even that granola over there doesn't look so innocent anymore! Why wasn't the song \"Slop Time\", by the Sherrys, used as the theme?", "label": 1}
{"text": "A great and truly independent film that hit most of my emotions and carried me into another world. Isn't this why we go to the movies? I was especially impressed with the editing and the music, the combination of which was very transportive.", "label": 1}
{"text": "What can I say, it's a damn good movie. See it if you still haven't. Great camera works and lighting techniques. Awesome, just awesome. Orson Welles is incredible 'The Lady From Shanghai' can certainly take the place of 'Citizen Kane'.", "label": 1}
{"text": "The first time you see The Second Renaissance it may look boring. Look at it at least twice and definitely watch part 2. It will change your view of the matrix. Are the human people the ones who started the war ? Is AI a bad thing ?", "label": 1}
{"text": "A mix of comedy, romance, music(?!), action and horror. A knockout. This is one of the reasons people rave about Hong Kong cinema. If you're looking for something totally original, look no further. Entertainment at it's peak.", "label": 1}
{"text": "There's never a dull moment in this movie. Wonderful visuals, good actors, and a classical story of the fight of good and evil. Mostly very funny, sometimes even scary. A true classic, a movie everybody should see.", "label": 1}
{"text": "If there is a movie to be called perfect then this is it. So bad it wasn't intended to be that way. But superb anyway... Go find it somewhere. Whatever you do... Do not miss it!!!", "label": 1}
{"text": "This is just a short comment but I stumbled onto this movie by chance and I loved it. The acting is great, the story is simple and touching, and the lines, especially from the 4-yr-old Desi, are so cute and sad. Seek it out.", "label": 1}
{"text": "Very smart, sometimes shocking, I just love it. It shoved one more side of David's brilliant talent. He impressed me greatly! David is the best. The movie captivates your attention for every second.", "label": 1}
